---
kind: property
id: P:Autodesk.Revit.DB.DimensionType.AlternateUnitsSuffix
source: html/fc89169d-afb1-55e4-c8c0-98fab0f097ef.htm
---
# Autodesk.Revit.DB.DimensionType.AlternateUnitsSuffix Property

The suffix text for the alternate units value.

## Syntax (C#)
```csharp
public string AlternateUnitsSuffix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null